# Usando NumPy com Pandas

In [3]:
# Importando o NumPy e Pandas
import numpy as np
from pandas as pd

In [4]:
#Criando um dataframe
data = {'estado':['santa catarina','parana','goias','bahia','minas gerais'],
        'ano':[2002,2003,2004,2005,2006],
        'populacao':[1.5,1.7,3.6,2.4,2.9]}

frame = pd.DataFrame(data)
frame

           estado   ano  populacao
0  santa catarina  2002        1.5
1          parana  2003        1.7
2           goias  2004        3.6
3           bahia  2005        2.4
4    minas gerais  2006        2.9

In [5]:
#definindo as colunas
pd.DataFrame(data,columns=['ano','estado','populacao'])

    ano          estado  populacao
0  2002  santa catarina        1.5
1  2003          parana        1.7
2  2004           goias        3.6
3  2005           bahia        2.4
4  2006    minas gerais        2.9

In [6]:
#adicionando colunas ao dataframe
frame2 = pd.DataFrame(data,columns=['ano','estado','populacao','debito'],index=['um','dois','tres','quatro','cinco'])
frame2

         ano          estado  populacao debito
um      2002  santa catarina        1.5    NaN
dois    2003          parana        1.7    NaN
tres    2004           goias        3.6    NaN
quatro  2005           bahia        2.4    NaN
cinco   2006    minas gerais        2.9    NaN

In [7]:
#Usando numPy para alimentar a coluna debito
frame2['debito'] = np.arange(5.)
frame2

         ano          estado  populacao  debito
um      2002  santa catarina        1.5     0.0
dois    2003          parana        1.7     1.0
tres    2004           goias        3.6     2.0
quatro  2005           bahia        2.4     3.0
cinco   2006    minas gerais        2.9     4.0

In [8]:
#verifica valores
frame2.values

array([[2002, 'santa catarina', 1.5, 0.0],
       [2003, 'parana', 1.7, 1.0],
       [2004, 'goias', 3.6, 2.0],
       [2005, 'bahia', 2.4, 3.0],
       [2006, 'minas gerais', 2.9, 4.0]], dtype=object)

In [10]:
#retorno estatistico
frame2.describe()

               ano  populacao    debito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

## Localizando Registros dentro do DataFrame

In [11]:
frame2.loc['quatro']

ano           2005
estado       bahia
populacao      2.4
debito           3
Name: quatro, dtype: object

In [12]:
frame2.iloc[2]

ano           2004
estado       goias
populacao      3.6
debito           2
Name: tres, dtype: object

In [16]:
## Invertendo colunas e indices
web_stats = {'dias':[1,2,3,4,5,6,7],
            'visitantes':[45,23,67,78,23,12,14],
            'taxas':[11,22,33,44,55,66,77]}
df = DataFrame(web_stats)
print(df)

   dias  visitantes  taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55
5     6          12     66
6     7          14     77

In [17]:
#visualizando coluna como indice
print(df.set_index('dias'))

      visitantes  taxas
dias
1             45     11
2             23     22
3             67     33
4             78     44
5             23     55
6             12     66
7             14     77

In [18]:
df.head()

   dias  visitantes  taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55